

#include "RJ_TIM.H"

void _RJ_TIM_ERR(void); //错误死循环;

/* 定于软件定时器结构体变量 */
static SOFT_TMR s_tTmr[RJ_TIM_END];
uint32_t RunTime=0;

/*
*********************************************************************************************************
*	函 数 名: _RJ_TIM_ERR
*	功能说明: 故障死循环
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void _RJ_TIM_ERR(void) 
{
	uint8_t i=1;	
	while(i)
	{	
	}
}

/*
*********************************************************************************************************
*	函 数 名: _InitTimer
*	功能说明: 初始化软件定时器变量
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void _InitTimer(void)
{
	uint32_t i;

	/* 清零所有的软件定时器 */
	for (i = 0; i < RJ_TIM_END; i++)
	{
		s_tTmr[i].Count = 0;
		s_tTmr[i].PreLoad = 0;
		s_tTmr[i].Flag = 0;
		s_tTmr[i].Mode = TMR_ONCE_MODE;	/* 缺省是1次性工作模式 */
	}
}


/*
*********************************************************************************************************
*	函 数 名: _StartTimer
*	功能说明: 启动一个定时器，并设置定时周期。
*	形    参:  	_id     : 定时器ID，值域【0,TMR_COUNT-1】。用户必须自行维护定时器ID，以避免定时器ID冲突。
*				_period : 定时周期，单位1ms
*	返 回 值: 无
*********************************************************************************************************
*/
void _StartTimer(TMR_ID_E _id, uint32_t _period)
{
	s_tTmr[_id].Count = _period;		/* 实时计数器初值 */
	s_tTmr[_id].PreLoad = _period;		/* 计数器自动重装值，仅自动模式起作用 */
	s_tTmr[_id].Flag = 0;				/* 定时时间到标志 */
	s_tTmr[_id].Mode = TMR_ONCE_MODE;	/* 1次性工作模式 */	
}

/*
*********************************************************************************************************
*	函 数 名: bsp_StartAutoTimer
*	功能说明: 启动一个自动定时器，并设置定时周期。
*	形    参:  	_id     : 定时器ID，值域【0,TMR_COUNT-1】。用户必须自行维护定时器ID，以避免定时器ID冲突。
*				_period : 定时周期，单位1ms
*	返 回 值: 无
*********************************************************************************************************
*/
void _StartAutoTimer(TMR_ID_E _id, uint32_t _period)
{
	s_tTmr[_id].Count = _period;			/* 实时计数器初值 */
	s_tTmr[_id].PreLoad = _period;		/* 计数器自动重装值，仅自动模式起作用 */
	s_tTmr[_id].Flag = 0;				/* 定时时间到标志 */
	s_tTmr[_id].Mode = TMR_AUTO_MODE;	/* 自动工作模式 */
}

/*
*********************************************************************************************************
*	函 数 名: bsp_StopTimer
*	功能说明: 停止一个定时器
*	形    参:  	_id     : 定时器ID，值域【0,TMR_COUNT-1】。用户必须自行维护定时器ID，以避免定时器ID冲突。
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_StopTimer(TMR_ID_E _id)
{
	s_tTmr[_id].Count = 0;				/* 实时计数器初值 */
	s_tTmr[_id].Flag = 0;				/* 定时时间到标志 */
	s_tTmr[_id].Mode = TMR_ONCE_MODE;	/* 自动工作模式 */
}

/*
*********************************************************************************************************
*	函 数 名: bsp_CheckTimer
*	功能说明: 检测定时器是否超时
*	形    参:  	_id     : 定时器ID，值域【0,TMR_COUNT-1】。用户必须自行维护定时器ID，以避免定时器ID冲突。
*				_period : 定时周期，单位1ms
*	返 回 值: 返回 0 表示定时未到， 1表示定时到
*********************************************************************************************************
*/
uint8_t _CheckTimer(TMR_ID_E _id)
{
	if (s_tTmr[_id].Flag == 1)
	{
		s_tTmr[_id].Flag = 0;
		return 1;
	}
	else
	{
		return 0;
	}
}

/*
*********************************************************************************************************
*	函 数 名: bsp_GetRunTime
*	功能说明: 获取CPU运行时间，单位1ms。最长可以表示 24.85天，如果你的产品连续运行时间超过这个数，则必须考虑溢出问题
*	形    参:  无
*	返 回 值: CPU运行时间，单位1ms
*********************************************************************************************************
*/
uint32_t _GetRunTime(void)
{
	uint32_t runtime;	

	runtime = RunTime;	
	return runtime;
}




/*
*********************************************************************************************************
*	函 数 名: bsp_SoftTimerDec
*	功能说明: 每隔1ms对所有定时器变量减1。必须被SysTick_ISR周期性调用。
*	形    参:  _tmr : 定时器变量指针
*	返 回 值: 无
*********************************************************************************************************
*/
static void _SoftTimerDec(SOFT_TMR *_tmr)
{
	if (_tmr->Count > 0)
	{
		/* 如果定时器变量减到1则设置定时器到达标志 */
		if (--_tmr->Count == 0)
		{
			_tmr->Flag = 1;

			/* 如果是自动模式，则自动重装计数器 */
			if(_tmr->Mode == TMR_AUTO_MODE)
			{
				_tmr->Count = _tmr->PreLoad;
			}
		}
	}
}


/*
*********************************************************************************************************
*	函 数 名: _RJ_TIM_1MS_ISR
*	功能说明: 把该函数放到1MS的定时器中断里面
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void _RJ_TIM_1MS_ISR(void)
{
	uint8_t i=0;

	/* 每隔 1ms，对软件定时器的计数器进行减一操作 */
	for (i = 0; i < RJ_TIM_END; i++)
 {
	_SoftTimerDec(&s_tTmr[i]);
 }

 /* 全局运行时间每 1ms 增 1 */
 RunTime++;
 if (RunTime == 0x7FFFFFFF) 
 {
		RunTime = 0;
 }
}



