

#include "RJ_PWM.H"

//---------配置区------------------




//定义PWM 全局变量
RJ_PWM_T g_rjpwm[RJ_PWM_END];

void rj_pwm_error(void)
{
    uint8_t i=1;
    while (i)
    {
        /* code */
    }
}

/*
*********************************************************************************************************
*	函 数 名: pwm_out_io_h
*	功能说明: 设置PWM引脚 为高电平
*	形    参: _id :PWM ID
*	返 回 值: 无
*********************************************************************************************************
*/
void pwm_out_io_h(RJ_PWM_ID _id)
{
	if(_id == RJ_PWM1)
	{
		HAL_GPIO_WritePin(LD1_GPIO_Port,LD1_Pin,GPIO_PIN_SET);	
	}
	else if(_id == RJ_PWM2)
	{
		HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,GPIO_PIN_SET);	
	}
}


/*
*********************************************************************************************************
*	函 数 名: pwm_out_io_l
*	功能说明: 设置PWM引脚 为低电平
*	形    参: _id :PWM ID
*	返 回 值: 无
*********************************************************************************************************
*/
void pwm_out_io_l(RJ_PWM_ID _id)
{
	if(_id == RJ_PWM1)
	{
		HAL_GPIO_WritePin(LD1_GPIO_Port,LD1_Pin,GPIO_PIN_RESET);	
	}
	else if(_id == RJ_PWM2)
	{
		HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,GPIO_PIN_RESET);	
	}
}
/*
*********************************************************************************************************
*	函 数 名: rj_pwm_init
*	功能说明: 初始化RJ_PWM
*	形    参: _id :LED灯ID
*	返 回 值: 无
*********************************************************************************************************
*/
void rj_pwm_init(void)
{




}

/*
*********************************************************************************************************
*	函 数 名: rj_pwm_time_loop
*	功能说明: 该函数放到定时器循环中,PWM 的周期 都是以这个定时器为基准
*	形    参: 无
*	返 回 值: 无
*	note		: 不建议放到1us的定时器中,用STM32F1测试发现,1us会堵死MCU,放到0.1ms的定时器中,10级够用了
*********************************************************************************************************
*/
void rj_pwm_time_loop(void)
{
    uint8_t i=0;
    for ( i = 0; i < RJ_PWM_END; i++)
    {
        /* code */
        if (g_rjpwm[i].ucEnalbe == 1)
        {
            g_rjpwm[i].count++;           
        }
    }
}



/*
*********************************************************************************************************
*	函 数 名: rj_pwm_code_loop
*	功能说明: PWM 实现 函数 ,需要放到main 主函数中无限循环
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void rj_pwm_code_loop(void)
{
    uint8_t i=0;
    for ( i = 0; i < RJ_PWM_END; i++)
    {
        /* code */
        if (g_rjpwm[i].ucEnalbe == 1)
        {
            /* code */
            if (g_rjpwm[i].count <= g_rjpwm[i].h_coun)
            {
                /* code */
                pwm_out_io_h(i);
            }
            else
            {
                /* code */
                pwm_out_io_l(i);
            }

						if(g_rjpwm[i].count >= g_rjpwm[i].count_reg )
						{
							g_rjpwm[i].count=0;
						}
        }
    }
}


/*
*********************************************************************************************************
*	函 数 名: set_rj_pwm
*	功能说明: 设置 pwm的 周期和占空比
*	形    参: 
*           _id     :   PWM id
*           cyc     :   周期,单位 是 rj_pwm_time_loop()
*           h_cyc   :   高电平持续时间 单位是 rj_pwm_time_loop()
*	返 回 值: 无
*********************************************************************************************************
*/
void set_rj_pwm(RJ_PWM_ID _id,uint32_t cyc,uint32_t h_cyc)
{
    g_rjpwm[_id].count_reg=cyc;
    g_rjpwm[_id].h_coun=h_cyc;
}

/*
*********************************************************************************************************
*	函 数 名: rj_pwm_qidong
*	功能说明: 启动一个PWM
*	形    参: 
*           _id     :   PWM id
*	返 回 值: 无
*********************************************************************************************************
*/
void rj_pwm_qidong(RJ_PWM_ID _id)
{
    g_rjpwm[_id].ucEnalbe=1;
}

/*
*********************************************************************************************************
*	函 数 名: rj_pwm_guanbi
*	功能说明: 关闭一个PWM,电平状态不定
*	形    参: 
*           _id     :   PWM id
*           sta     :   关闭后引脚的状态,
*                        -0:低电平
*                       -1:高电平
*	返 回 值: 无
*********************************************************************************************************
*/
void rj_pwm_guanbi(RJ_PWM_ID _id,uint8_t sta)
{
    g_rjpwm[_id].ucEnalbe=1;

    if (sta == 0)
    {
        /* code */
        pwm_out_io_l(_id);
    }
    else
    {
        /* code */
        pwm_out_io_h(_id);
    }
}



